# TrussFamilyTopChordEndReleaseType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussFamilyTopChordEndReleaseType Property
ParameterTypeId Class See Also
---
"End Release"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyTopChordEndReleaseType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyTopChordEndReleaseType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyTopChordEndReleaseType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace